{
  "project10": {
    "name": "Ce site web (v2)",
    "description": "<br><em>projet solo</em>",
    "logo": "/content/images/javascript_logo.png",
    "datenum": "en cours",
    "datestart": "Avril 2018",
    "dateend": "en cours",
    "content": [
      {
        "type": "libs",
        "data": "sdjhf"
      },
      {
        "type": "text",
        "data": "Utilisation du javascript pour rendre le site plus rapide à mettre à jour."
      },
      {
        "type": "img",
        "data": "/content/images/website.png"
      },
      {
        "type":"text",
        "data":"Un premier script (à gauche sur le graphique) va générer le Menu et le pied de page. Ce premier script utilise l'url pour montrer visuellement sur quelle page se trouve l'utilisateur."
      },
      {
        "type":"text",
        "data":"Le second script va dans un premier temps récupérer l'url, et en fonction de celle ci charger un des différents fichiers JSON. Une fois que le fichier est chargé, le script va transformer le json en un morceau de page web (que vous visionnez actuellement)"
      }
    ]
  },
  "project9": {
    "name": "Segmentation d'images médicales",
    "description": "<em>(Projet de fin d'études, 3 personnes)</em>",
    "logo": "/content/images/python_logo.png",
    "datenum": "5 mois",
    "datestart": "Octobre 2017",
    "dateend": "Février 2018",
    "content": [
      {
        "type": "libs",
        "data": ""
      },
      {
        "type": "title",
        "data": "Description du projet"
      },
      {
        "type": "text",
        "data": "Le projet consistait à isoler (segmentation) l'arche aortique d'une séquence d'images scanner, et de visualiser le résultat en 3D."
      },
      {
        "type": "text",
        "data": "Le projet a été réalisé en partenariat avec Basecamp Vascular, qui cherche à créer des cathéter plus pratique. Ces cathéters sont utilisés dans des opérations 'légère' du cerveau qui passent par le réseau sanguin."
      },
      {
        "type": "title",
        "data": "Résultat"
      },
      {
        "type": "text",
        "data": "Les résultats du projet ont été au delà des attentes, car nous avons réussi non seulement à segmenter la zone de l'aorte, mais aussi les artères et les gros vaisseaux sanguins jusqu'à la base du cerveau (machoire)."
      },
      {
        "type": "img",
        "data": "/content/images/aorte1.png"
      },
      {
        "type": "img",
        "data": "/content/images/aorte2.png"
      },
      {
        "type": "img",
        "data": "/content/images/aorte3.png"
      }
    ]
  },
  "project8": {
    "name": "Autres projets / TP / Concours à l'esme",
    "description": "<br>",
    "logo": "/content/images/webgl_logo.png",
    "datenum": "",
    "datestart": "2013",
    "dateend": "2018",
    "content": [
      {
        "type": "title",
        "data": "2018"
      },
      {
        "type": "ullist",
        "data": [
          "(Matlab) Utilisation de maths morphologiques et d'outils d'image processing avancé",
          "(C++, OpenCV) Utilisation d'OpenCV pour de la vision par ordinateur",
          "(C#) Creation d'un enrivonnement VR avec Unity / leap motion",
          "(Présentation) Recherches sur les outils d'imagerie médicale et les voxels",
          "(C++) Visualisation en Raytracing d'objets (aucune librairie)"
        ]
      },
      {
        "type": "title",
        "data": "2017"
      },
      {
        "type": "ullist",
        "data": [
          "(SQL) Creation, optimisation et gestion de databases avec PostgreSQL",
          "(NodeJS, Vorpal, Net) Creation d'un chat clients/serveur sur terminal (client connecté)",
          "(Javascript) Gestion automatique de ressources",
          "(Python, Qt) Création et gestion d'un annuaire avec interface graphique",
          "(Java) Création d'un calculateur de résistance avec interface graphique"
        ]
      },
      {
        "type":"title",
        "data":"2016 - 2015 et antérieur"
      },
      {
        "type": "ullist",
        "data": [
          "2016 - (VHDL) Simulation d'une horloge à affichage numérique en utilisant un oscillateur à qwartz",
          "2015 - (Python) Réalisation d'un jeu 2D en python",
          "2015 - (Présentation) Recherches et réalisation de plans pour une maison à énergie neutre et de moyens d'isolation (comment orienter la maison et les rebords pour utiliser un maximum de chaleur naturelle, aérogel de silice, toitures végétales, barrière radiante)",
          "2015 - (Fablab) Creation d'un drone",
          "2015 - (Concours) Premère place au concours 'Iseg Innovation Week' avec un bracelet connecté",
          "2014 - (Concours) Participation au concours Cisco's IoT challenge avec une box domotique"
        ]
      }
    ]
  },
  "project7": {
    "name": "Creation d'un environement 3D",
    "description": "<em>(projet scolaire, 2 personnes)</em>",
    "logo": "/content/images/webgl_logo.png",
    "datenum": "4h",
    "datestart": "2018",
    "dateend": " Semestre 1",
    "content": [
      {
        "type": "text",
        "data": "Il s'agit d'un TP de 4h, et une bibliothèque privée à disposition. L'objectif du TP était de recréer une scène où un X-wing évitait des astéroides"
      },
      {
        "type": "text",
        "data": "Chaque astéroide, ainsi que les mouvements du vaisseau étaient calculés pour ne pas être trop répétitif, des ombres étaient calculées ainsi qu'un Cel-shader. Les étoiles scintillent grâce à une rotation de la texture et une interpolation linéaire"
      },
      {
        "type": "img",
        "data": "/content/images/webgl1.png"
      },
      {
        "type": "img",
        "data": "/content/images/webgl2.png"
      },
      {
        "type": "img",
        "data": "/content/images/webgl3.png"
      }
    ]
  },
  "project6": {
    "name": "Creation d'un site web full stack",
    "description": "<em>(projet scolaire, 2 personnes)</em>",
    "logo": "/content/images/java_logo.png",
    "datenum": "3 jours",
    "datestart": "2017",
    "dateend": " Semestre 2",
    "content": [
      {
        "type": "text",
        "data": "Nous avions comme objectif de réaliser en 3 jours un intranet d'école en utilisant Spring, un framework JEE."
      },
      {
        "type": "text",
        "data": "Le site est connecté à une database mysql et gère plusieurs type d'utilisateur: Admin, Etudiant ou Enseignant"
      },
      {
        "type": "img",
        "data": ""
      },
      {
        "type": "link",
        "data": "https://github.com/MelAbgrall/jeeIntranet",
        "linktext": "le code source du projet est disponible ici"
      }
    ]
  },
  "project5": {
    "name": "Ce site web (v1)",
    "description": "<br><em>Projet solo</em>",
    "logo": "/content/images/html_logo.png",
    "datenum": "3 mois",
    "datestart": "Septembre",
    "dateend": "Octobre 2017",
    "content": [
      {
        "type": "text",
        "data": "La première version de ce site web, entièrement réalisé à la main en HTML, et utilisant le framework css Bootstrap"
      },
      {
        "type": "title",
        "data": "SOURCES:"
      },
      {
        "type": "html",
        "data": "<ul><li>Mapael</li><li>Bootstrap</li><li>FontAwesome</li><li>Hover.css</li></ul>"
      },
      {
        "type": "title",
        "data": "Photographies"
      },
      {
        "type": "text",
        "data": "toutes les photographies présentes sur ce site sont aussi visionables en meilleure qualité sur mon portfolio."
      },
      {
        "type": "html",
        "data": "<p>Locations:</p><p>Accueil : Glacier du géant (Mont Blanc)</p><p>Accueil du CV : Drone piloté à OSI, Crupies (Auvergne, France)</p><p>Education, ESME Paris : Lever de soleil à Ivry sur Seine</p><p>Education, ESME Lyon : Cheval de la place Bellecour, Fête des lumières</p><p>Education, Valmiera : Vue de Valmiera en hiver</p><p>Expérience, Photographie : Guide sur le glacier du géant</p><p>Contact : Montagne en face du Cervin (Zermatt, Suisse)</p><p>Portfolio : Plage en Sicile</p><p>Les photos sont sous copyright, vous pouvez les utiliser librement à partir du moment où vous me citez</p>"
      }
    ]
  },
  "project4": {
    "name": "Reconnaissance vocale (I.A.)",
    "description": "<em>(projet scolaire, 3 personnes)</em>",
    "logo": "/content/images/cpp_logo.png",
    "datenum": "6 mois",
    "datestart": "2017",
    "dateend": " Semestre 1",
    "content": [
      {
        "type": "title",
        "data": "Le projet:"
      },
      {
        "type": "text",
        "data": "L'idée était de découvrir l'IA et d'en faire une application : la reconnaissance vocale. Nous avions deux choix : prendre des morceaux de code déjà existants type plug-n-play (simple à utiliser, même sans comprendre), ou le choix plus difficile de tout faire en partant de 0, le souci étant que nous n'avions absolument aucune connaissance en IA. Nous avons choisi la seconde méthode, car elle présentait aussi des avantages, en particulier de devoir apprendre quelques fondamentaux de l’IA. Le projet n'a pas été mené a son terme par manque de temps, néanmoins le logiciel réalisé répondait à la première partie du cahier des charges."
      },
      {
        "type": "title",
        "data": "La technique"
      },
      {
        "type": "text",
        "data": "<p>Comme nous n'avons utilisé aucune API pour faire du deep learning, la première partie de notre travail a consisté à nous autoformer aux principes de base nécessaires pour réaliser le projet.</p><p>Une fois ces principes de base assimilés, nous avons directement codé des algorithmes de back propagation, les neurones, ainsi que les fonctions d'activations (sigmoïdes). Nous avons continué sur les paramètres du réseau, ils sont sauvegardés dans plusieurs fichiers externes (un fichier par couche qui contient les poids des neurones, ainsi qu'un fichier principal avec le nombre de couches et le nombre de neurones pour chaque couche).</p><p>Le programme fonctionne de la manière suivante : un fichier .mp3 est envoyé au programme qui utilise un convertisseur pour générer une image du signal audio (DSP) (unique partie écrite en Pyhon) puis cette image est analysée colonne par colonne : chaque pixel de la colonne est converti en trois valeurs RGB puis injecté dans un réseau de neurones. Celui-ci déclenche une propagation qui doit donner une lettre. Le programme fonctionne de deux manières : en mode apprentissage, où une fois que la lettre est récupérée en sortie, un autre algorithme de backpropagation va modifier les neurones une par une pour réduire l’erreur, et le mode prédiction, où on ne fait pas intervenir cette backpropagation.</p><p>J’ai été en charge de l’interface utilisateur (réalisée sur Qt), ainsi que l’architecture du programme (MVC). J’ai aussi aidé à implanter la backpropagation, et la structure des neurones.</p><p>Le projet s'est avéré en partie opérationnel, mais n'a pu être mené à son terme par manque de temps. Il nous a néanmoins apporté une première approche constructive l'IA.</p>"
      }
    ]
  },
  "project3": {
    "name": "Carte d'un jeu 2D procédurale",
    "description": "<em>(projet scolaire, 3 personnes)</em>",
    "logo": "/content/images/cpp_logo.png",
    "datenum": " 6 mois",
    "datestart": "2017",
    "dateend": " Semestre 1",
    "content": [
      {
        "type": "title",
        "data": "Le projet:"
      },
      {
        "type": "text",
        "data": "Le projet a été mené en parallèle du projet en IA, il consistait à faire un jeu vidéo en utilisant uniquement le C++, et Qt. (une vidéo présente le rendu tout en bas)"
      },
      {
        "type": "text",
        "data": "J’ai réalisé le système de carte ainsi que les différents environnements associés : la carte est générée de manière aléatoire, mais en gardant un minimum de contrôle."
      },
      {
        "type": "text",
        "data": "La carte est représentée par blocs : un bloc est un espace vide ou plein sur la carte. La carte fait 120 blocs en largeur et en hauteur, et elle est découpée en 16 régions qui elles-mêmes font 30 blocs de large. Ces régions, appelées biomes représentent un des 4 environnements : désert, plaine, jungle ou ville."
      },
      {
        "type": "text",
        "data": "Région après région, le programme va choisir aléatoirement quel biome sera représenté, puis il génère les 90 blocs qui le composent. Il existe deux types de bloc : un obstacle (ou bloc plein), et un bloc vide sur lequel le personnage peut se déplacer. Chaque bloc est choisi aléatoirement, néanmoins pour éviter que le joueur ne soit bloqué trop souvent, le choix est pondéré : il y a moins de chances d’obtenir un obstacle. Lorsque les blocs sont générés, ils sont stockés dans un tableau, qui représente la carte."
      },
      {
        "type": "img",
        "data": "/content/images/map.png"
      },
      {
        "type": "text",
        "data": "Lorsque le tableau est complet, il est envoyé au jeu qui va appliquer les textures et les propriétés du bloc en fonction de leur identifiant."
      },
      {
        "type": "text",
        "data": "Les blocs sont identifiés par un numéro à deux chiffres : le premier (ou les dizaines) indique le biome, le deuxième (ou les unités) le type de bloc : de 0 à 6 il s’agit d’un bloc où le personnage peut passer (les textures changent avec le numéro), et pour 7, 8 et 9, il s’agit d’un obstacle (un arbre, un rocher, etc). Par exemple 02 indique un bloc d’herbe dans une jungle, 09 un arbre dans une jungle, 12 un bloc de fleurs dans une plaine et 18 un rocher dans une plaine."
      },
      {
        "type": "text",
        "data": "La carte est générée à chaque nouvelle partie."
      },
      {
        "type": "vid",
        "data": "https://www.youtube.com/embed/KHj4XO35oxo?rel=0"
      }
    ]
  },
  "project2": {
    "name": "Creation d'un editeur d'image",
    "description": "<em>(projet scolaire, solo)</em>",
    "logo": "/content/images/cpp_logo.png",
    "datenum": "6 mois",
    "datestart": "2016",
    "dateend": " semestre 2",
    "content": [
      {
        "type": "text",
        "data": "<p>En 4e année premier semestre, nous avons eu à préparer un éditeur d'image basique en utilisant l'interface de Qt et les propriétés des threads.</p> <p>Le programme permet de mettre plusieurs images sur un fond, de les bouger, de leur faire effectuer une rotation degré par degré vers la droite ou la gauche ou de leur appliquer un filtre grayscale (méthode RGB en nuances de gris, on ne touche pas à la saturation). On peut aussi bloquer les modifications ou débloquer une image.</p><p>Chaque transformation ou blocage/déblocage peut être appliquée en même temps sur une ou plusieurs images en les sélectionnant via la souris</p><p>La partie de grayscalling utilise les Qthreads</p>"
      }
    ]
  },
  "project1": {
    "name": "Recherches sur les réseaux intranet",
    "description": "<em>(projet scolaire, solo)</em>",
    "logo": "/content/images/cisco_logo.png",
    "datenum": "1 mois",
    "datestart": "2016",
    "dateend": " semestre 1",
    "content": [
      {
        "type": "text",
        "data": " Projet réalisé à Valmiera. L'objectif était d'expliquer et de comparer les réseaux LAN, VLAN et MAN, trois types de réseaux qui permettent de faire des 'intranet' sécurisés et efficaces"
      },
      {
        "type": "text",
        "data": "Le projet a été réalisé avec l'aide de Cisco packet tracer."
      },
      {
        "type": "img",
        "data": "/content/images/vlan1.png"
      },
      {
        "type": "text",
        "data": "ci dessus: Protocole de récupération de donnée entre un client et un serveur (ex: une page web). A chaque étape entre le client et le serveur (1 -> 6), une couche de donnée supplémentaire est rajoutée (représentée par le carré en couleurs), afin de retrouver le chemin inverse (6 -> 11)"
      },
      {
        "type": "img",
        "data": "/content/images/vlan2.png"
      },
      {
        "type": "text",
        "data": "ci dessus: un exemple de réseau d'une petite entreprise avec 6 VLAN"
      }
    ]
  }
}