{
  "exp7": {
    "name": "Commitee member [student society]",
    "type": "society",
    "description": "<em><br>Heriot Watt Uni. Photography society</em>",
    "logo": "../../content/images/hwu_logo.png",
    "datenum": "Ongoing",
    "datestart": "August 2018",
    "dateend": "now",
    "content": [
      {
        "type": "text",
        "data": "I joined the photography society when arriving to Heriot Watt, to share my knowledge and help organisation in the society."
      },
      {
        "type": "text",
        "data": "I helped the society in multiple ways, and I was in charge of two important activities in the society: manage the organisation of trips in the Scottish highlands for 10 to 20 people, and making several workshop and tutorials for the members of the society (click on the link to access those courses)"
      },
      {
        "type": "ullist",
        "data": [
          "<a href=\"https://1drv.ms/p/s!Ald8Q8ssAVWKh2VUZ7oL_1sMdsoa\">Introduction to programmation with C++, Java, Javascript and Python</a>",
          "<a href=\"\">Advanced programming</a>",
          "<a href=\"https://1drv.ms/p/s!Ald8Q8ssAVWKiDaTRht0rwF5H3Cc\">Introduction to machine learning and data science",
          "<a href=\"\">Computer hardware and introduction to linux</a>"
        ]
      }
    ]
  },
  "exp6": {
    "name": "Research intern in AI",
    "type": "internship",
    "description": "<em><br>école des mines ParisTech / ARMINES</em>",
    "logo": "../../content/images/logo_minespt.png",
    "datenum": "5 Months",
    "datestart": "April",
    "dateend": "August 2018",
    "content": [
      {
        "type": "title",
        "data": "The school"
      },
      {
        "type": "text",
        "data": "The school of Mines ParisTech is a french engineering school deeply involved in research. I worked at the CMM (Mathematical Morphology Center) which specialize in image processing."
      },
      {
        "type": "title",
        "data": "Reasearch / missions"
      },
      {
        "type": "text",
        "data": "The main project was to research for new way to defend neural networks against adversarial examples (attacks that can be described as optical illusions for artificial intelligence). I found a way to defend neural networks against those attacks using mathematical morphology, and a publication is currently being written by my supervisor."
      },
      {
        "type": "text",
        "data": "The second project was to use active learning (a methodology used to train artificial intelligence) on neural networks used in image segmentation. The imediate objective was to successfully separate different layers of skin tissues on microscope images. The goal was to measure how much melanin was present in a specific layer. The long term objective was to create an \"interactive\" AI algorithm that could be used by everyone. I proved that active learning could be used to reduce the use of very large datasets/labelise datasets during training: it only require 5 to 10 percent of a fully labeled dataset to achieve almost the same results."
      }
    ]
  },
  "exp5": {
    "name": "Web / Business Intelligence internship",
    "type": "internship",
    "description": "<em>IT-CE (IT at Caisse d'épargne)</em>",
    "logo": "../../content/images/logo_itce.png",
    "datenum": "3 months",
    "datestart": "5 June",
    "dateend": "30 August 2017",
    "content": [
      {
        "type": "title",
        "data": "The company"
      },
      {
        "type": "text",
        "data": "IT-CE is the IT department of BPCE group. BPCE result from a merge of two banks (Banque populaire and Caisse d’épargne). IT-CE ideals with IT of the company from architecture to network including research & development."
      },
      {
        "type": "text",
        "data": "My internship took place in the unit “Architecture and innovation” which is in charge of software architecture for their proprietary software as well as commercial software."
      },
      {
        "type": "title",
        "data": "Missions"
      },
      {
        "type": "text",
        "data": "The first mission was to develop decision-making dashboards using PowerBi and MSSQL. The dashboards displayed in almost real time, all software creations or modifications within the company."
      },
      {
        "type": "smallimg",
        "data": "../../content/images/tab_powerBi.png"
      },
      {
        "type": "text",
        "data": "The second mission was to develop an automated website for documentation: Writen in C# (ASP.NET) the website collects Word document, analyses it and store its content in a database and a JSON file, allowing to see this content later in a web page. The website goal was to be easy to use and read (Chapters in the document were replaced by clickable drop-down menus, the interface was developed to be able to get straight to the point)."
      }
    ]
  },
  "exp2": {
    "name": "President [student society]",
    "type": "society",
    "description": "<em><br>BDA ESME Paris (Bureau des Arts)</em>",
    "logo": "../../content/images/logo_bdaparis.png",
    "datenum": "1 year",
    "datestart": "September 2016",
    "dateend": "September 2017",
    "content": [
      {
        "type": "text",
        "data": "When I joined, the Art society was inactive since many years. I took over the association with a new team of about ten people. One of the first objectives was to set up partnerships with the school and other associations, for example with a photographic support on all events"
      },
      {
        "type": "text",
        "data": "The Art society then became partner with freshly created French federation of Art societies, and I helped as far as possible the federation, contacting other art societies in France, actively participating and relaying Federation’s events to ESME students."
      },
      {
        "type": "text",
        "data": "<img class=\"d-flex flex-column flex-grow flex-align-items-center mx-auto d-block\" src=\"../../content/images/logo_ffbda.png\" style=\"height:40%\">"
      },
      {
        "type": "text",
        "data": "<br>In middle of the year, the student art society took over the old video game society which was also inactive since several years. The objective was to dynamize the art society with a more various choice of activities"
      },
      {
        "type": "img",
        "data": "../../content/mabphotography/DSC_2650c.jpg"
      }
    ]
  },
  "exp4": {
    "name": "Internship in an IT department",
    "type": "internship",
    "description": "<em><br>Centre Hospitalier Princesse Grâce (CHPG)</em>",
    "logo": "../../content/images/logo_hopital.png",
    "datenum": "1 month",
    "datestart": "1st",
    "dateend": "30 August 2016",
    "content": [
      {
        "type": "title",
        "data": "The company"
      },
      {
        "type": "text",
        "data": "The hospital Princesse Grâce is the major public hospital in Monaco. It has a capacity of 759 bed shared in three buildings."
      },
      {
        "type": "text",
        "data": "I did my internship in the IT department, which was in charge of the network, security and software management of the hospital."
      },
      {
        "type": "title",
        "data": "Mission"
      },
      {
        "type": "text",
        "data": "During this internship, I developed a software for the Nao robot. It was used in the geriatric department for old people with memory disabilities."
      },
      {
        "type": "smallimg",
        "data": "../../content/images/nao.png"
      },
      {
        "type": "text",
        "data": "The robot is used by medical staff, so the software is designed to work without a computer: to update recognised patients, the staff only needs to touch some sensors during power up process, and indicates whose patient to add or remove from the robot’s memory."
      }
    ]
  },
  "exp1": {
    "name": "Class representative [Latvia]",
    "type": "society",
    "description": "<em>ViA (Lettonie)</em>",
    "logo": "../../content/images/via_logo.png",
    "datenum": "7 months",
    "datestart": "December 2015",
    "dateend": "June 2016",
    "content": [
      {
        "type": "text",
        "data": "I was the interface between the students and the partner university."
      }
    ]
  },
  "exp0": {
    "name": "President [student society]",
    "type": "society",
    "description": "<em><br>BDA ESME Lyon (Bureau des Arts)</em>",
    "logo": "../../content/images/logo_bdalyon.png",
    "datenum": "7 months",
    "datestart": "July 2015",
    "dateend": "January 2016",
    "content": [
      {
        "type": "Title",
        "data": "Association"
      },
      {
        "type": "text",
        "data": "When I arrived at ESME Lyon, I had the chance to meet music enthusiast. However, due to the recent opening of the campus, there was not any art association. So I created the Art society with a team of ten people, each of them having an administrative role or art oriented role."
      },
      {
        "type": "text",
        "data": "I did not have much time because I was going to the exchange program at the end of the year, but we managed to create regular activities in music, photography, cinema, and various others. Those activities continued after my departure."
      },
      {
        "type": "smallimg",
        "data": "../../content/mabphotography/bdalyon.jpg"
      }
    ]
  },
  "exp3": {
    "name": "Science educator / Member",
    "type": "OSI",
    "description": "<em>Objectif Science International (OSI)</em>",
    "logo": "../../content/images/logo_osi.png",
    "datenum": "multiple missions",
    "datestart": "",
    "dateend": "From 2014",
    "content": [
      {
        "type": "title",
        "data": "The NGO"
      },
      {
        "type": "text",
        "data": "Objectif Science International is a NGO which goal is to promote science research and nature protection through holiday camps and various events. It has consultative status at the UN."
      },
      {
        "type": "smallimg",
        "data": ""
      },
      {
        "type": "title",
        "data": "Missions"
      },
      {
        "type": "text",
        "data": "I had the opportunity to do multiple missions with OSI with various duration (from two weeks to a month). Outside the missions, I kept a lot of contact with the NGO, by going regularly to preparation meetings for summer camp and general council meetings."
      },
      {
        "type": "text",
        "data": "I was science educator on the camp “drone connection”. The first objective of this camp was sensitisation to drones, UAVs and computer science. The other objective was to help other camps with drones & UAVs created by the children."
      },
      {
        "type": "text",
        "data": "My mission was to create recreational activities based on electronics, drones and computer science for children from 7 to 17, adapting those activities with the ages."
      },
      {
        "type": "title",
        "data": "Some feedback from our camp (intended for the parents)"
      },
      {
        "type": "ullist",
        "data": [
          "Beware, this content is writen in french",
          "<a href=\"http://prog-paradisaea.com/Drone-Connection-Provence-du-24,154.html\">2016 Provence (2 semaines)</a>",
          "<a href=\"http://www.osi-drone-connection.org/Drone-connection-Alpes-Suisses-20.html\">2014 Suisse (2 semaines)</a>",
          "<a href=\"http://www.osi-drone-connection.org/Drone-connection-Pyrenees-06-au-20.html\">2014 Pyrénées (1 semaine)</a>",
          "<a href=\"http://www.osi-drone-connection.org/Drone-connection-Provence-06-au-20.html\">2014 Provence (1 semaine)</a>"
        ]
      }
    ]
  }
}